ka2_2024/src/InformationRegisters/СреднийЗаработокСтрахователейСЭДО/СреднийЗаработокСтрахователейСЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СреднийЗаработокСтрахователейСЭДО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗаработокПоТекущему</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаработокПоТекущемуГПХ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Страхователь</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ka2_2024/src/InformationRegisters/СреднийЗаработокСтрахователейСЭДО/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбработкаПроведенияРегистратора(РегистраторОбъект, Отказ, РежимПроведения) Экспорт
	Очистить();
	
	Если Не ЗначениеЗаполнено(РегистраторОбъект.Дата)
		Или Не ЗначениеЗаполнено(РегистраторОбъект.Страхователь)
		Или Не ЗначениеЗаполнено(РегистраторОбъект.ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из РегистраторОбъект.ДанныеОЗаработке Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.РасчетныйГод) Тогда
			Продолжить;
		КонецЕсли;
		Движение = Добавить();
		Движение.Регистратор            = РегистраторОбъект.Ссылка;
		Движение.Период                 = РегистраторОбъект.Дата;
		Движение.ФизическоеЛицо         = РегистраторОбъект.ФизическоеЛицо;
		Движение.Страхователь           = РегистраторОбъект.Страхователь;
		Движение.РасчетныйГод           = СтрокаТаблицы.РасчетныйГод;
		Движение.ЗаработокПоТекущему    = СтрокаТаблицы.ЗаработокПоТекущему;
		Движение.ЗаработокПоТекущемуГПХ = СтрокаТаблицы.ЗаработокПоТекущемуГПХ;
		Движение.СНИЛС                  = РегистраторОбъект.СНИЛС;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
